ConfigFiles/Catalogs/ВидыСогласуемыхРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыСогласуемыхРесурсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласующий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/ВидыСогласуемыхРесурсов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОсновнойВидСогласуемогоРесурса() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыСогласуемыхРесурсов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыСогласуемыхРесурсов КАК ВидыСогласуемыхРесурсов
	|ГДЕ
	|	ВидыСогласуемыхРесурсов.Основной";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если  Выборка.Следующий() Тогда
	
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ЕдинственныйВидРесурса() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
	|	ВидыСогласуемыхРесурсов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыСогласуемыхРесурсов КАК ВидыСогласуемыхРесурсов
	|ГДЕ
	|	НЕ ВидыСогласуемыхРесурсов.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ВидРесурсаПоУмолчанию() Экспорт
	
	ОсновнойВидРесурса = ОсновнойВидСогласуемогоРесурса();
	
	Если ОсновнойВидРесурса <> Неопределено Тогда
		
		Возврат ОсновнойВидРесурса;
		
	КонецЕсли;
	
	Возврат ЕдинственныйВидРесурса();
	
КонецФункции

Функция ПредставлениеВидаРесурса(ВидРесурса) Экспорт
	
	ПредставлениеВида = "";
	
	Если Не ЗначениеЗаполнено(ВидРесурса) Тогда
		Возврат ПредставлениеВида;
	КонецЕсли;
	
	РеквизитыВида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидРесурса, "Наименование, ЕдиницаИзмерения");
	
	Возврат ЗадачиПроцессовКлиентСервер.ПредставлениеВидаРесурса(РеквизитыВида.Наименование, РеквизитыВида.ЕдиницаИзмерения);
	
КонецФункции

#КонецОбласти

#КонецЕсли
